[
    {
        "id": 946665000,
        "title": "വിശുദ്ധവാര തിരുക്കർമങ്ങൾ",
        "category": "Updates",
        "author": "No author given",
        "date": "No date given",
        "thumbnail": "https://media.istockphoto.com/id/1382384282/photo/bangalore-or-bengaluru.jpg?s=612x612&w=0&k=20&c=6pxwL3JxNV2B_NZSLMZLhrSLqAbyCPlGuSZYKImpjKQ=",
        "content": "BCC is the extension of the life and times of the apostles, soon after the crucification of Jesus. They feared persecution and death in the hands of his killers. Their faith and belief in him was beginning to set in and doubts disappear by the working of the Holy Spirit who had descended upon them enabling them to speak many languages, filling them with a noble rage to go out into the world and spread the gospel. So intense in sprit where they at that time, that they met within closed doors and talked in chaste whispers. They forsake everything they had and shared among themselves, whatever they had. Not only the apostles, the people who heard them, also brought in whatever they had in cash or kind and food was served to the people who gathered there in the name of resurrected Jesus. Today, the situation is different only in that the word of the lord has been heard all around us. But, like the seeds that fell on the rock or perhaps the wayside, they do not produce any fruit. Our faith in the resurrected Christ and his presence in the Holy Eucharist has to percolate down into our very elements. There is no more places for’ Doubting Thomases’ and people who take the word of our Lord with a pinch of salt. Even in India, which is the largest democracy in the world, where freedom of religion is enshrined in the constitution, persecution of Christians is rampant ,especially in the north. Many of us fear and most of us feel shy to speak about the Gospel of our Lord. It is the opening of our ears and the embolden of ourselves that the BCC aims to achieve. Characteristics of the B.C.Cs 
        - Faithfulness to fellowship 
        - Word of God becomes the source of their life and relationship 
        - They minister to each other in their pastoral, social and educational needs.
        
        They become an Eucharistic community. Very. Rev. Fr. Richard D’Cruz 2001-2005 Very. Rev. Dr.C. Joseph 2005-2011 Very Rev. Msgr. John D. Bosco 2011-2015 Very. Rev. Fr. George Gomez 2015-2018 Very Rev. Msgr. Nicholas T. The first characteristic of the B.C.Cs is deepening the relationship between the members and the reconciliation between each other, so that they can be witnesses to the love of Christ by breaking all  divisions in the community. This experience of fellowship gives them a sense of belonging and they come to the understanding that Christianity is not commitment to some ideas but commitment to persons. Contribution of the B.C.Cs 
        
        1. Increased the participation of laity in the life of the Diocese. 
        2. Lay leadership grew qualitatively, especially the leadership of women. 
        3. Liturgy and participation in sacraments and family prayer became more active. 
        4. Spreading and breaking of the Word of God increased. 
        5. Ability to pray spontaneously 
        6. Social commitment has increased so that they minister to each other to a large extent. 
        7. Developed the different talents of the people. 8. Attitudinal change in the people brought about generosity and deeper fellowship. 
        8. People feel that they are the Church and their sense of belongingness increased. 
        9. The faith of the people and the capacity to forgive each other have increased. 
        10. Popular devotion and active participation in the pious associations increased. 
         
        
        A three tier system - Diocese, Vicariate, Parish was introduced. The Basic Christian Communities (BCC) of the parish assembles at least once in a month in one of the houses for the meeting. A BCC unit consists of families from 20 to 30 in number, in a particular geographical area. The programme of the meeting consists of prayer, reading, sharing of the Word, discussion based on the reading, in the background of local need, occasion or a particular situation. The discussions ultimately lead the unit to undertake a particular mission/programme. The meeting can be a celebration of religious festival, local festival, different occasions of family life etc. The method of conduct of meeting is suitably modified to suit the occasion, retaining the basic elements of the B.C.C. Wards are the structures that consist of different BCC units. Parish level leaders meeting are held regularly for the evaluation and implementing of further programmes in the parish In the Forane level, Forane commission meeting is held regularly under the leadership of the priest coordinator of the BCC ministry In the Archdiocese, the Director of B.C.C. convenes the meeting of animators, co-ordinators, and resource team whenever necessary. Latin Arch Diocese, Thiruvananthapuram, BCC’s vision is all about Renewal of Life through the Word in relation to community There are six wards in St Joseph’s Metropolitan Cathedral.
        -  Palayam 
        -  Kunnukuzhy East
        -  Kunnukuzhy West
        -  Rishimangalam
        -  Pattom",
    },
    {
        "id": 946665000,
        "title": "test123",
        "category": "Updates",
        "author": "No author given",
        "date": "No date given",
        "thumbnail": "https://media.istockphoto.com/id/1382384282/photo/bangalore-or-bengaluru.jpg?s=612x612&w=0&k=20&c=6pxwL3JxNV2B_NZSLMZLhrSLqAbyCPlGuSZYKImpjKQ=",
        "content": "test test test"
    }
]